In [1]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'], 'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'], 'value': [5, 6, 7, 8]})

In [7]:
df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})

In [8]:
df1

     a  b
0  foo  1
1  bar  2

In [18]:
df2

     a  c
0  foo  3
1  baz  4

In [19]:
df1.merge(df2, how='inner', on='a')

     a  b  c
0  foo  1  3

In [20]:
df1.merge(df2, how='outer', on='a')

     a    b    c
0  foo  1.0  3.0
1  bar  2.0  NaN
2  baz  NaN  4.0

In [54]:
df1 = pd.DataFrame({'year': [1920, 1930, 1940], 'col1': [1, 2, 3], 'col2': ['r', 's', 't']})
df2 = pd.DataFrame({'year': [1920, 1920, 1930, 1930, 1940, 1940], 'value': ['a', 'a', 'b', 'b', 'c', 'c']})
df1 = df1.set_index('year')
df2 = df2.set_index('year')

In [55]:
df1

      col1 col2
year
1920     1    r
1930     2    s
1940     3    t

In [56]:
df2

     value
year
1920     a
1920     a
1930     b
1930     b
1940     c
1940     c

In [57]:
df1

      col1 col2
year
1920     1    r
1930     2    s
1940     3    t

In [58]:

df2

     value
year
1920     a
1920     a
1930     b
1930     b
1940     c
1940     c

In [64]:
df1.merge(df2, on='year')

      col1 col2 value
year
1920     1    r     a
1920     1    r     a
1930     2    s     b
1930     2    s     b
1940     3    t     c
1940     3    t     c

In [88]:
df1 = pd.DataFrame({'year': [1920, 1930, 1940], 'col1': [1, 2, 3], 'col2': ['rr', 'ss', 'tt']})
df2 = pd.DataFrame({'year': [1920, 1920, 1930, 1930, 1940, 1940], 'value': ['a', 'a', 'b', 'b', 'c', 'c']})

In [89]:
df1

   year  col1 col2
0  1920     1   rr
1  1930     2   ss
2  1940     3   tt

In [90]:
df2

   year value
0  1920     a
1  1920     a
2  1930     b
3  1930     b
4  1940     c
5  1940     c

In [95]:
pd.concat([df1, df2], join='inner', axis=1)

   year  col1 col2  year value
0  1920     1   rr  1920     a
1  1930     2   ss  1920     a
2  1940     3   tt  1930     b

In [103]:
pd.merge(df1,df2[['value','year']],on='year', how='left').drop_duplicates()

   year  col1 col2 value
0  1920     1   rr     a
2  1930     2   ss     b
4  1940     3   tt     c

In [107]:
df1 = pd.DataFrame({'year': [1920, 1930, 1940], 'col1': [1, 2, 3], 'col2': ['rr', 'ss', 'tt']})
df2 = pd.DataFrame({'year': [1920, 1920, 1930, 1930, 1940, 1940], 'value': ['a', 'a', 'b', 'b', 'c', 'c']})

In [108]:
pd.merge(df1,df2[['value','year']],on='year', how='left').drop_duplicates()

   year  col1 col2 value
0  1920     1   rr     a
2  1930     2   ss     b
4  1940     3   tt     c